openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/

/** @reqSettings DEFAULT_SPECIFICATION_REVISION=3.1.5 */

/* ----------------------------[information]----------------------------------*/
/*
 * Author: mahi
 *
 * Part of Release:
 *   3.1.5
 *
 * Description:
 *   Implements the SPI driver module
 *
 * Support:
 *   General                     Have Support
 *   -------------------------------------------
 *   SPI_CANCEL_API                 N
 *   SPI_CHANNEL_BUFFERS_ALLOWED    Y/N, Supports only level 1 (0:IB,1:EB,2:IB+EB)
 *   SPI_DEV_ERROR_DETECT           Y
 *   SPI_HW_STATUS_API              N
 *   SPI_INTERRUPTIBLE_SEQ_ALLOWED  N
 *   SPI_LEVEL_DELIVERED            Y/N, supports only level 2 (0:sync,1:sync,2:both)
 *   SPI_VERSION_INFO_API           Y
 *
 *   Extra:
 *   - DMA and FIFO is implementations
 *   - Soft CS by callback
 *
 *
 *   Device
 *   - MPC5606S
 *
 * Implementation Notes:
 * - This driver implements SPI_LEVEL_DELIVERED = 2 but with a number
 *   of restrictions. See REQ. below for more information.
 *
 * - A sequence may use different CS's if the controller is the same.
 *   ( All jobs that belongs to a sequence MUST share the same controller )
 *
 * - The driver uses Spi_DataType as uint8. This means that an 16-bit address have
 *   a length of 2 when setting upASetting async/sync mode is not supported
 *   ( Spi_SetAsyncMode(), SPI188, etc )
 * - Cancel API is NOT supported
 *    ( SPI_CANCEL_API must be STD_OFF )
 *
 * - It's not obvious how to use different modes. My interpretation:
 *
 *   Sync
 *     Always blocking in Spi_SyncTransmit()
 *
 *
 * Info:
 *   - The AsyncModeType (SPI_POLLING_MODE,SPI_INTERRUPT_MODE) is used to handle only the
 *     async API, ie Spi_AsyncTransmit().  The synchrone API just calls Spi_SyncTransmit()->Spi_Isr()....
 *
 *
 *   Async and INTERRUPT
 *
 *   Async and POLLING
 *     Not supported since ??
 *
 * - Some sequence charts
 *
 *
 * == Sync ==
 *       WriteSeq   ISR   WriteJob   MainFunction_Driving
 *       -------------------------------------------------
 *       |          |        |                |
 *       ------>
 *       ---------------->
 *       <---------------
 * ( for each job we will now get an interrupt that write's the next job)
 *                  ----->
 *                  <-----
 *                  ...
 *       <-----
 *
 * == Async and INTERRUPT ==
 *
 *       ------>
 *       ---------------->
 *       <---------------
 *       <-----
 * ( for each job we will now get an interrupt that write's the next job)
 *                  ----->
 *                  <-----
 *       ....
 *
 *
 * == Async and POLLING ==
 * ( Not supported yet )
 *
 *       ------>
 *       ---------------->
 *       <---------------
 *       <-----
 * ( for each job in the sequence the sequence must be repeated )
 *       ---------------------------------->
 *                       <-----------------
 *                 ------>
 *                 <-----
 *                       ------------------>
 *       <----------------------------------
 *       ...
 *
 *
 */

/* HW INFO
 * -----------------------------------------------
 * 4 DSPI modules, A,B,C and D
 * 7 CTAR's for each module.( data-width, baudrate )
 *
 */

/* NOTIFICATION INFORMATION
 * -----------------------------------------------
 *
 * There's a LOT of status and notification in this module....
 *
 *                           Job1              Job2
 *                     |---------------|---------------|
 *                                    JN              JN,SN
 * Status    IDLE             BUSY           BUSY           IDLE
 * HwStatus  IDLE             BUSY           BUSY           IDLE
 * JobResult JOB_OK      JOB_PENDING       JOB_PENDING      JOB_OK,SPI_JOB_FAILED
 * SeqResult SEQ_OK      SEQ_PENDING       SEQ_PENDING      SEQ_OK,SEQ_FAILED,SEQ_CANCELLED
 *
 * JN - JOb Notification
 * SN - Sequence NOtificaiton
 */

/* ----------------------------[includes]------------------------------------*/

#include <stdlib.h>
#include <assert.h>
#include <limits.h>
#include <string.h>
#include "Spi.h"
#include "mpc55xx.h"
//#include <stdio.h>
#include "Mcu.h"
#include "math.h"
#if (SPI_IMPLEMENTATION==SPI_DMA)
#include "Dma.h"
#endif
#include "Det.h"
#include "isr.h"
/* ----------------------------[private define]------------------------------*/

#define SPIE_BAD		  (-1)
#define SPIE_OK				0
#define SPIE_JOB_NOT_DONE   1

//#define SPI_IMPLEMENTATION	SPI_FIFO
#define USE_DIO_CS          STD_ON

// E2 read = cmd + addr + data = 1 + 2 + 64 ) = 67 ~ 72
#define SPI_INTERNAL_MTU    72

/* The depth of the HW FIFO */
#define FIFO_DEPTH			5

/* Define for debug purposes, checks that SPI/DMA is ok */
//#define STEP_VALIDATION		1

#define MODULE_NAME 	"/driver/Spi"

//#define USE_LDEBUG_PRINTF	1
#undef DEBUG_LVL
#define DEBUG_LVL DEBUG_NONE
#include "debug.h"

//#define USE_LOCAL_RAMLOG
#if defined(USE_LOCAL_RAMLOG)
#define RAMLOG_STR(_x) ramlog_str(_x)
#define RAMLOG_DEC(_x) ramlog_dec(_x)
#else
#define RAMLOG_STR(_x)
#define RAMLOG_DEC(_x)
#endif

/* ----------------------------[private macro]-------------------------------*/

#ifndef MIN
#define MIN(_x,_y) (((_x) < (_y)) ? (_x) : (_y))
#endif
#ifndef MAX
#define MAX(_x,_y) (((_x) > (_y)) ? (_x) : (_y))
#endif

