openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
#define GET_SPI_HW_PTR(_unit) 	\
        ((volatile struct DSPI_tag *)(0xFFF90000 + 0x4000*(_unit)))

#define GET_SPI_UNIT_PTR(_unit) &Spi_Unit[_unit]

#define ENABLE_EOQ_INTERRUPT(_spi_hw) _spi_hw->RSER.B.EOQF_RE = 1
#define DISABLE_EOQ_INTERRUPT(_spi_hw) _spi_hw->RSER.B.EOQF_RE = 0

#define GET_HW(_channel)    ( volatile struct DSPI_tag *)((uint32)&DSPI_A + 0x4000 * _channel )

/* Development error macros. */
#if ( SPI_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_SPI,0,_api,_err); \
          return; \
        }

#define VALIDATE_W_RV(_exp,_api,_err,_rv ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_SPI,0,_api,_err); \
          return (_rv); \
        }
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_W_RV(_exp,_api,_err,_rv )
#endif

/* ----------------------------[private typedef]-----------------------------*/

#if (SPI_IMPLEMENTATION == SPI_DMA )
typedef struct Spi_DmaConfig {
	 Dma_ChannelType RxDmaChannel;
	 Dma_ChannelType TxDmaChannel;
} Spi_DmaConfigType;

#endif



typedef union {
	vuint32_t R;
	struct {
		vuint32_t CONT :1;
		vuint32_t CTAS :3;
		vuint32_t EOQ :1;
		vuint32_t CTCNT :1;
		vuint32_t :4;
		vuint32_t PCS5 :1;
		vuint32_t PCS4 :1;
		vuint32_t PCS3 :1;
		vuint32_t PCS2 :1;
		vuint32_t PCS1 :1;
		vuint32_t PCS0 :1;
		vuint32_t TXDATA :16;
	} B;
} SPICommandType;

typedef SPICommandType Spi_CommandType;
typedef struct {
	const Spi_DataType *    src;    /* Pointer to source buffer */
	Spi_DataType *          dest;   /* Pointer to destination buffer */
	Spi_NumberOfDataType    length; // Number of elements of Spi_DataType in destination buffer
	_Bool                   active; // Set if the buffer is configured.
} Spi_EbType;

typedef enum {
	SPI_ASYNC_CALL,
	SPI_SYNC_CALL,
} Spi_CallTypeType;

typedef struct {
	uint8 ctarId;    // this channel is assigned to this CTAR
} Spi_ChannelInfoType;

/**
 * This structure represents a controller unit
 */
typedef struct {

#if (SPI_IMPLEMENTATION==SPI_DMA)
	Dma_ChannelType dmaTxChannel;       // Tx DMA channel information
	Dma_TcdType     dmaTxTCD;
	Dma_ChannelType dmaRxChannel;      // Rx DMA channel information
	Dma_TcdType     dmaRxTCD;
    Spi_CommandType txQueue[SPI_INTERNAL_MTU];      // Pointed to by SADDR of DMA
    uint32          rxQueue[SPI_INTERNAL_MTU];      // Pointed to by DADDR of DMA
#endif
	uint32          txCurrIndex;                    // current index for data when sending
	uint32          channelCodes[7];                // Helper array to assign CTAR's
	Spi_StatusType status;                          // Status for this unit
	const Spi_JobConfigType *       currJob;         // The current job
	const Spi_JobType *             currJobIndexPtr; // Points array of jobs current
    Spi_JobType                     currJobIndex;
	const Spi_SequenceConfigType *  currSeqPtr;     // The Sequence
	Spi_CallTypeType callType;                      // 1 -  if the current job is sync. 0 - if not
} Spi_UnitType;

typedef struct {
	Spi_SeqResultType seqResult;
} Spi_SeqUnitType;

typedef struct {
	volatile struct DSPI_tag *      hwPtr;            /* The HW device used by this Job */
	const Spi_ExternalDeviceType *  extDeviceCfgPtr;  /* The external device used by this job */
	const Spi_JobConfigType *       jobCfgPtr;
	Spi_UnitType *                  unitPtr;
	const Spi_ChannelType *         channelsPtr;
#if (SPI_IMPLEMENTATION == SPI_FIFO )
	uint32_t    fifoSent;          /* Number of bytes in FIFO (before EOQ is set) */
	uint8_t     currTxChIndex;     /* the currently transmitting channel index for FIFO */
	uint32_t    txChCnt;           /* number of Spi_DataType sent for the current channel */
	uint32_t    rxChCnt;           /* number of Spi_DataType received for the current channel */
	uint32_t    currRxChIndex;     /* the currently receiving channel index for FIFO */
#endif
	Spi_JobResultType jobResult;
} Spi_JobUnitType;

typedef struct {
	boolean initRun;                            // Initially FALSE set to TRUE if Spi_Init() have been called
	const Spi_ConfigType *  configPtr;          // Pointer to the configuration
	Spi_EbType *            extBufPtr;          // Pointer to the external buffers
	Spi_ChannelInfoType *   channelInfo;
	uint32                  spiHwConfigured;    // Mask if the HW unit is configured or not
	Spi_AsyncModeType       asyncMode;

	/* This is a bunch of debug counters. */
	uint32 totalNbrOfTranfers;
	uint32 totalNbrOfStartedJobs;
	/* Counters for busy waiting for DSPI and DMA. */
	uint32 totalNbrOfWaitTXRXS;
	uint32 totalNbrOfWaitRxDMA;
#if  defined(STEP_VALIDATION)
	int eoqf_cnt;
	int txrxs_cnt;
#endif
} Spi_GlobalType;

/* ----------------------------[private function prototypes]-----------------*/
/* ----------------------------[private variables]---------------------------*/

#if (SPI_IMPLEMENTATION==SPI_DMA)
/* Templates for Rx/Tx DMA structures */
const Dma_TcdType Spi_DmaTx = {
		.SADDR = 0, .SMOD = 0, .SSIZE = DMA_TRANSFER_SIZE_32BITS, .DMOD = 0,
		.DSIZE = DMA_TRANSFER_SIZE_32BITS, .SOFF = 4, .NBYTESu.R = 4, .SLAST = 0,
		.DADDR = 0, .CITERE_LINK = 0, .CITER = 0, .DOFF = 0, .DLAST_SGA = 0,
		.BITERE_LINK = 0, .BITER = 0, .BWC = 0, .MAJORLINKCH = 0, .DONE = 0,
		.ACTIVE = 0, .MAJORE_LINK = 0, .E_SG = 0, .D_REQ = 0, .INT_HALF = 0,
		.INT_MAJ = 0, .START = 0 };

const Dma_TcdType Spi_DmaRx = { .SADDR = 0, .SMOD = 0,
		.SSIZE = DMA_TRANSFER_SIZE_32BITS, .DMOD = 0,
		.DSIZE = DMA_TRANSFER_SIZE_32BITS, .SOFF = 0, .NBYTESu.R = 4, .SLAST = 0,
		.DADDR = 0, .CITERE_LINK = 0, .CITER = 1, .DOFF = 4, .DLAST_SGA = 0,
		.BITERE_LINK = 0, .BITER = 1, .BWC = 0, .MAJORLINKCH = 0, .DONE = 0,
		.ACTIVE = 0, .MAJORE_LINK = 0, .E_SG = 0, .D_REQ = 0, .INT_HALF = 0,
#if defined(__DMA_INT)
		.INT_MAJ = 1,
#else
		.INT_MAJ = 0,
#endif
		.START = 0 };
#endif

Spi_GlobalType  Spi_Global;
Spi_EbType      Spi_Eb[SPI_MAX_CHANNEL];
Spi_UnitType    Spi_Unit[SPI_CONTROLLER_CNT];
Spi_SeqUnitType Spi_SeqUnit[SPI_MAX_SEQUENCE];
Spi_JobUnitType Spi_JobUnit[SPI_MAX_JOB];
Spi_ChannelInfoType Spi_ChannelInfo[SPI_MAX_CHANNEL];


#if (SPI_IMPLEMENTATION == SPI_DMA)
/* When using DMA it assumes predefined names */
Spi_DmaConfigType  Spi_DmaConfig[4] = {
#if (SPI_USE_HW_UNIT_0 == STD_ON )
	{
	    .RxDmaChannel = DMA_DSPI_A_RESULT_CHANNEL,
	    .TxDmaChannel = DMA_DSPI_A_COMMAND_CHANNEL,
	},
#else
	{ (Dma_ChannelType)0, (Dma_ChannelType)0 },
#endif
#if (SPI_USE_HW_UNIT_1 == STD_ON )
	{
	    .RxDmaChannel = DMA_DSPI_B_RESULT_CHANNEL,
	    .TxDmaChannel = DMA_DSPI_B_COMMAND_CHANNEL,
	},
#else
	{ (Dma_ChannelType)0, (Dma_ChannelType)0 },
#endif
#if (SPI_USE_HW_UNIT_2 == STD_ON )
	{
	    .RxDmaChannel = DMA_DSPI_C_RESULT_CHANNEL,
	    .TxDmaChannel = DMA_DSPI_C_COMMAND_CHANNEL,
	},
#else
	{ (Dma_ChannelType)0, (Dma_ChannelType)0 },
#endif
#if (SPI_USE_HW_UNIT_3 == STD_ON )
	{
	    .RxDmaChannel = DMA_DSPI_D_RESULT_CHANNEL,
	    .TxDmaChannel = DMA_DSPI_D_COMMAND_CHANNEL,
	}
#else
	{ (Dma_ChannelType)0, (Dma_ChannelType)0 },
#endif
};
#endif

/* ----------------------------[private functions]---------------------------*/

