openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
#if (SPI_IMPLEMENTATION == SPI_FIFO )
static void Spi_WriteJob_FIFO( Spi_JobType jobIndex );

/**
 * Get the buffer for a channel.
 *
 * @param ch
 * @param length
 * @return
 */
static Spi_DataType *spiGetRxBuf(Spi_ChannelType ch, Spi_NumberOfDataType *length ) {
	Spi_DataType *buf;
	if( Spi_Global.configPtr->SpiChannelConfig[ch].SpiChannelType == SPI_EB ) {
		*length = Spi_Global.extBufPtr[ch].length;
		buf = Spi_Global.extBufPtr[ch].dest;
	} else {
		/* No support */
		assert(0);
		buf = NULL;
	}
	return buf;
}

static const Spi_DataType *spiGetTxBuf(Spi_ChannelType ch, Spi_NumberOfDataType *length ) {
	const Spi_DataType *buf;
	if( Spi_Global.configPtr->SpiChannelConfig[ch].SpiChannelType == SPI_EB ) {
		*length = Spi_Global.extBufPtr[ch].length;
		buf = Spi_Global.extBufPtr[ch].src;
	} else {
		/* No support */
		assert(0);
		buf = NULL;
	}
	return buf;
}
#endif

static void Spi_Isr(uint32);

static void Spi_Isr_A(void) {
	Spi_Isr(DSPI_CTRL_A);
}
static void Spi_Isr_B(void) {
	Spi_Isr(DSPI_CTRL_B);
}
static void Spi_Isr_C(void) {
	Spi_Isr(DSPI_CTRL_C);
}
static void Spi_Isr_D(void) {
	Spi_Isr(DSPI_CTRL_D);
}
/* ----------------------------[public functions]----------------------------*/

uint32 Spi_GetJobCnt(void);
uint32 Spi_GetChannelCnt(void);
uint32 Spi_GetExternalDeviceCnt(void);

#if 0
static void Spi_Isr_DMA( void )
{
	// Clear interrupt
	Dma_ClearInterrupt(5);
}
#endif

static void Spi_JobWrite(Spi_JobType jobIndex);

static void Spi_SetJobResult(Spi_JobType Job, Spi_JobResultType result) {
	Spi_JobUnit[Job].jobResult = result;
}

static void Spi_SetHWUnitStatus(Spi_HWUnitType HWUnit, Spi_StatusType status) {
	Spi_Unit[HWUnit].status = status;
}

/**
 * Get external Ptr to device from index
 *
 * @param deviceType The device index.
 * @return Ptr to the external device
 */

static inline const Spi_ExternalDeviceType *Spi_GetExternalDevicePtrFromIndex(
		Spi_ExternalDeviceTypeType deviceType) {
	return (&(Spi_Global.configPtr->SpiExternalDevice[(deviceType)]));
}

/**
 * Get configuration job ptr from job index
 * @param jobIndex the job
 * @return Ptr to the job configuration
 */
static const Spi_JobConfigType *Spi_GetJobPtrFromIndex(Spi_JobType jobIndex) {
	return &Spi_Global.configPtr->SpiJobConfig[jobIndex];
}

/**
 * Get sequence ptr from sequence index
 * @param seqIndex the sequence
 * @return Ptr to the sequence configuration
 */
static const Spi_SequenceConfigType *Spi_GetSeqPtrFromIndex(
		Spi_SequenceType SeqIndex) {
	return &Spi_Global.configPtr->SpiSequenceConfig[SeqIndex];
}

/**
 * Get unit ptr from unit index
 * @param unit the unit
 * @return Ptr to the SPI unit
 */
static Spi_UnitType *Spi_GetUnitPtrFromIndex(uint32 unit) {
	return &Spi_Unit[unit];
}

/**
 * Function to see if two sequences share jobs
 *
 * @param seq - Seqence 1
 * @param seq - Seqence 2
 * @return 0 - if the don't share any jobs
 *        !=0 - if they share jobs
 */

static boolean Spi_ShareJobs(Spi_SequenceType seq1, Spi_SequenceType seq2) {
	uint32 seqMask1 = 0;
	uint32 seqMask2 = 0;
	const Spi_JobType *jobPtr;
	const Spi_SequenceConfigType *seqConfig;

	// Search for jobs in sequence 1
	seqConfig = Spi_GetSeqPtrFromIndex(seq1);
	jobPtr = &seqConfig->JobAssignment[0];

	while (*jobPtr != JOB_NOT_VALID) {
		assert(*jobPtr<31);
		seqMask1 |= (1 << *jobPtr);
		jobPtr++;
	}

	// Search for jobs in sequence 2
	seqConfig = Spi_GetSeqPtrFromIndex(seq2);
	jobPtr = &seqConfig->JobAssignment[0];

	while (*jobPtr != JOB_NOT_VALID) {
		assert(*jobPtr<31);
		seqMask2 |= (1 << *jobPtr);
		jobPtr++;
	}

	return (seqMask1 & seqMask2);
}


//-------------------------------------------------------------------

/**
 * Sets a result for a sequence
 *
 * @param Sequence The sequence to set the result for
 * @param result The result to set.
 */
static void Spi_SetSequenceResult(Spi_SequenceType Sequence,
		Spi_SeqResultType result) {
	Spi_SeqUnit[Sequence].seqResult = result;
}

//-------------------------------------------------------------------


/**
 * Gets the next job to do
 *
 * @param spiUnit The SPI unit
 * @return The job ID. -1 if no more jobs
 */
static Spi_JobType Spi_GetNextJob(Spi_UnitType *spiUnit) {
	spiUnit->currJobIndexPtr++;
	return *(spiUnit->currJobIndexPtr);
}
//-------------------------------------------------------------------


#if (SPI_IMPLEMENTATION==SPI_DMA)

/**
 * Function to handle things after a transmit on the SPI is finished.
 * It copies data from it't local buffers to the buffers pointer to
 * by the external buffers
 *
 * @param spiUnit Ptr to a SPI unit
 */

static int Spi_Rx_DMA(Spi_UnitType *spiUnit) {
	_Bool printedSomeThing = 0;

	/* Stop the channels */
	Dma_StopChannel(spiUnit->dmaTxChannel);
	Dma_StopChannel(spiUnit->dmaRxChannel);

	RAMLOG_STR("PostTransmit Job: "); RAMLOG_DEC(spiUnit->currJob->SpiJobId); RAMLOG_STR("\n");

	/* Copy data from RX queue to the external buffer( if a<uny ) */
	{
		int j = 0;
		int currIndex = 0;
		int channelIndex;
		const Spi_ChannelConfigType *chConfig;
		Spi_EbType *extChBuff;
		int gotTx;
		int sentTx;

		// Check that we got the number of bytes we sent
		sentTx = spiUnit->txCurrIndex + 1;
		gotTx = (Dma_GetTcd(spiUnit->dmaRxChannel)->DADDR
				- (uint32) &spiUnit->rxQueue[0]) / sizeof(uint32);

		if (sentTx != gotTx) {
			// Something failed
			DEBUG(DEBUG_LOW,"%s: Expected %d bytes. Got %d bytes\n ",MODULE_NAME,sentTx, gotTx );
			return SPIE_BAD;
		} else {
			RAMLOG_STR("Rx "); RAMLOG_DEC(gotTx); RAMLOG_STR(" Bytes\n"); DEBUG(DEBUG_LOW,"%s: Got %d bytes\n",MODULE_NAME,gotTx);
		}

		// Find the channels for this job
		while ((channelIndex = spiUnit->currJob->ChannelAssignment[j++])
				!= CH_NOT_VALID) {
			chConfig = &Spi_Global.configPtr->SpiChannelConfig[channelIndex];

			/* Check configuration error */
#if ( SPI_CHANNEL_BUFFERS_ALLOWED == 1  )
			assert( chConfig->SpiChannelType == SPI_EB );
#endif

			// Send the channels that are setup with external buffers
			// Get the external buffer for this channel
			extChBuff = &Spi_Global.extBufPtr[channelIndex];
			if (extChBuff->dest != NULL) {
				// Note! No support for >8 "data"
				for (int k = 0; k < extChBuff->length; k++) {
					extChBuff->dest[k] = spiUnit->rxQueue[currIndex++];
					DEBUG(DEBUG_LOW," %02x ",extChBuff->dest[k]);
					printedSomeThing = 1;
				}

			} else {
				if (chConfig->SpiDataWidth > 8) {
					currIndex += (extChBuff->length / 2);
				} else {
					currIndex += extChBuff->length;
				}
			}
		}
		if (printedSomeThing)
			DEBUG(DEBUG_LOW,"\n");
	}

