openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	return 0;
}

#elif (SPI_IMPLEMENTATION==SPI_FIFO)

static int Spi_Rx_FIFO(Spi_UnitType *spiUnit) {
	Spi_JobUnitType *    jobUnitPtr;
	Spi_DataType *       buf;
    uint32_t             copyCnt;
	uint32_t             popVal;
	Spi_ChannelType      currChannel;
	Spi_NumberOfDataType bufLen;
    int i = 0;
    int rv = SPIE_JOB_NOT_DONE;
    const Spi_ChannelConfigType *   chConfig;
    uint32_t bInChar;


//	RAMLOG_STR("PostTransmit Job: "); RAMLOG_DEC(spiUnit->currJob->SpiJobId); RAMLOG_STR("\n");
    RAMLOG_STR("Spi_Rx_FIFO\n");

	jobUnitPtr = &Spi_JobUnit[spiUnit->currJobIndex];

	if( jobUnitPtr->hwPtr->TCR.B.SPI_TCNT != jobUnitPtr->fifoSent ) {
#if defined(STEP_VALIDATION)
	    while(1) {};
#endif
		return SPIE_BAD;
	}

	/*
	 * Fill receive buffers, either EB or IB
	 * Example with 8-bit CMD, 16-bit ADDR and some data.
	 *    CMD |  ADDR   |     DATA
	 *   | 12 | 23 | 34 | 00 | 01 | 02 | 03
	 *      1    2    3    4    5    6           BYTE CNT
	 *      1      2       3    4    5    6      FIFO
	 * With a FIFO of 5 we can see that the CMD, ADDR and almost the whole
	 * DATA channel is sent.
	 */
    currChannel = jobUnitPtr->channelsPtr[jobUnitPtr->currRxChIndex];
    assert(  currChannel != CH_NOT_VALID );

    if( jobUnitPtr->fifoSent != jobUnitPtr->hwPtr->SR.B.RXCTR ) {
#if defined(STEP_VALIDATION)
        while(1) {};
#endif
        return SPIE_BAD;
    }

	while ( jobUnitPtr->fifoSent != 0 ) {

        chConfig = &Spi_Global.configPtr->SpiChannelConfig[currChannel];

	    RAMLOG_STR("CIR#");RAMLOG_DEC(jobUnitPtr->currRxChIndex);RAMLOG_STR("\n");

	    /* Get this channels destination buffer */
		buf = spiGetRxBuf(currChannel, &bufLen);
		assert(bufLen!=0);  /* We should always get a valid bufLen */

        copyCnt = MIN( (bufLen - jobUnitPtr->rxChCnt) >> ((chConfig->SpiDataWidth-1)/8), jobUnitPtr->fifoSent );

        if( copyCnt == 0  ) {
#if defined(STEP_VALIDATION)
        while(1) {};
#endif
            return SPIE_BAD;
        }

        jobUnitPtr->fifoSent -= copyCnt;

        bInChar = (chConfig->SpiDataWidth > 8 ) ? 2 : 1;

        /* Pop the FIFO */
        if( buf != NULL ) {
            for(i=0;i<copyCnt;i++) {
                popVal = jobUnitPtr->hwPtr->POPR.B.RXDATA;
                buf[jobUnitPtr->rxChCnt] = (Spi_DataType)popVal;
                jobUnitPtr->rxChCnt += bInChar;
            }
        } else {
            for(i=0;i<copyCnt;i++) {
                popVal = jobUnitPtr->hwPtr->POPR.B.RXDATA;
                jobUnitPtr->rxChCnt += bInChar;

            }
        }

        if( (bufLen - jobUnitPtr->rxChCnt ) == 0 ) {
            /* advance to the next channel */
            jobUnitPtr->rxChCnt = 0;
            jobUnitPtr->currRxChIndex++;
            currChannel = jobUnitPtr->channelsPtr[jobUnitPtr->currRxChIndex];
            if( currChannel == CH_NOT_VALID ) {
                //assert(  jobUnitPtr->fifoSent == 0);
                jobUnitPtr->fifoSent = 0;
                jobUnitPtr->currRxChIndex = 0;
                rv = SPIE_OK;
                break;
            }

        }
	}

	/* Check if we are done with this job */
    if( 0 != jobUnitPtr->hwPtr->SR.B.RXCTR ) {
        while(1) {};
    }



	return rv;
}

#endif

//-------------------------------------------------------------------

/**
 * ISR for End of Queue interrupt
 *
 * @param unit The HW unit it happend on
 */
static void Spi_Isr(uint32 unit) {
	volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);
	Spi_UnitType *spiUnit = GET_SPI_UNIT_PTR(unit);
	int rv;

	RAMLOG_STR("Spi_Isr\n");

	// This may seem pretty stupid to wait for the controller
	// to shutdown here, but there seems to be no other way to do this.
	// Reasons:
	// - Waiting for DMA rx/tx hits earlier than EOQ.
	// - Other interrupts from SPI all hit earlier than EOQ.
	// TODO: There is the TCF_RE bit! Use this instead?

	// TODO: We could implement a timeout here and fail the job
	// if this never happens.

	// This is the busy wait when called from a non-interrupt context
	while (spiHw->SR.B.TXRXS) {
		Spi_Global.totalNbrOfWaitTXRXS++;
	}

#if (SPI_IMPLEMENTATION == SPI_DMA)
	while (!Dma_ChannelDone(Spi_Unit[unit].dmaRxChannel)) {
		Spi_Global.totalNbrOfWaitRxDMA++;
	}
#endif

	/* Halt DSPI unit until we are ready for next transfer. */
	spiHw->MCR.B.HALT = 1;
	spiHw->SR.B.EOQF = 1;

	Spi_Global.totalNbrOfTranfers++;

	// Disable EOQ interrupts
	// NOTE!
	//   This does NOT clear the interrupt request.
	//   That can only be done by clearing( setting ) the EOQ
	//   bit.. but that also triggers a new transfer.
	//
	// ALT
	//   A possibility could be to use the HALT bit instead of
	//   using this trick, but hey, this works

	DISABLE_EOQ_INTERRUPT(spiHw);

	// Update external buffers
#if (SPI_IMPLEMENTATION==SPI_DMA)
	rv = Spi_Rx_DMA(spiUnit);

#if (USE_DIO_CS == STD_ON)
    void (*cb)(int) = Spi_JobUnit[spiUnit->currJobIndex].extDeviceCfgPtr->SpiCsCallback;
    if( cb != NULL ) {
        cb(0);
    }
#endif
#elif (SPI_IMPLEMENTATION==SPI_FIFO)
	rv = Spi_Rx_FIFO(spiUnit);

	if( rv == SPIE_JOB_NOT_DONE ) {
	    /* RX FIFO now empty, but the job is not done -> send more */
	    Spi_WriteJob_FIFO ( spiUnit->currJobIndex );
		RAMLOG_STR("Spi_Isr END\n");
		return;
	}
#if (USE_DIO_CS == STD_ON)
	else {
	    void (*cb)(int) = Spi_JobUnit[spiUnit->currJobIndex].extDeviceCfgPtr->SpiCsCallback;
	    if( cb != NULL ) {
	        cb(0);
	    }
	}
#endif
#endif

	// Call notification end
	if (spiUnit->currJob->SpiJobEndNotification != NULL) {
		spiUnit->currJob->SpiJobEndNotification();
	}

	if (rv == SPIE_BAD) {
		// Fail both job and sequence
		Spi_SetHWUnitStatus(unit, SPI_IDLE);
		Spi_SetJobResult(spiUnit->currJob->SpiJobId, SPI_JOB_FAILED);
		Spi_SetSequenceResult(spiUnit->currSeqPtr->SpiSequenceId,
				SPI_SEQ_FAILED);
#if defined(STEP_VALIDATION)
		while(1) {};
#endif
	} else {
		Spi_JobType nextJob;

		// The job is at least done..
		Spi_SetJobResult(spiUnit->currJob->SpiJobId, SPI_JOB_OK);

		// WriteNextJob should
		// 1. Update the JobResult to SPI_JOB_OK
		// 2. Update the HWUnit status to IDLE

		// Re-cap.
		// - Jobs have the controller
		// - Sequences can we interruptible between jobs.
		// But
		// According to SPI086 you can't share a job with a sequence that
		// is in SPI_SEQ_PENDING ( that happens first thing at Spi_AsyncTranmit() )
		//
		// So, I no clue what to use the priority thing for :(

		nextJob = Spi_GetNextJob(spiUnit);
		if( nextJob != JOB_NOT_VALID ) {
			Spi_JobWrite(nextJob);
			RAMLOG_STR("more_jobs\n");
		} else {
			// No more jobs, so set HwUnit and sequence IDLE/OK also.
			Spi_SetHWUnitStatus(unit, SPI_IDLE);
			Spi_SetSequenceResult(spiUnit->currSeqPtr->SpiSequenceId,
					SPI_SEQ_OK);

			if (spiUnit->currSeqPtr->SpiSeqEndNotification != NULL) {
				spiUnit->currSeqPtr->SpiSeqEndNotification();
			}

			Spi_SetHWUnitStatus(unit, SPI_IDLE);

			/* We are now ready for next transfer. */
			spiHw->MCR.B.HALT = 1;

			RAMLOG_STR("NO_more_jobs\n");
		}
	}

