openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	RAMLOG_STR("Spi_Isr END\n");
}

//-------------------------------------------------------------------

Std_ReturnType Spi_WriteIB(Spi_ChannelType Channel,
		const Spi_DataType *DataBufferPtr) {
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_WRITEIB_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
	VALIDATE_W_RV( ( Channel<SPI_MAX_CHANNEL ), SPI_WRITEIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
	VALIDATE_W_RV( ( DataBufferPtr != NULL ), SPI_WRITEIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
	VALIDATE_W_RV( ( SPI_IB==Spi_Global.configPtr->SpiChannelConfig[Channel].SpiChannelType ),
			SPI_WRITEIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );

	/* According to SPI051 it seems that we only have to a "depth" of 1 */


	Std_ReturnType rv = E_NOT_OK;
	return rv;
}

/* Clock tables */
const uint32 clk_table_asc[] = { 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048,
		4096, 8192, 16384, 32768, 65536 };
const uint32 clk_table_cssck[] = { 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048,
		4096, 8192, 16384, 32768, 65536 };
const uint16 clk_table_br[] = { 2, 4, 6, 8, 16, 32, 64, 128, 256, 512, 1024, 2048,
		4096, 8192, 16384, 32768 };
const uint8 clk_table_pasc[] = { 1, 3, 5, 7 };
const uint8 clk_table_pcssck[] = { 1, 3, 5, 7 };
const uint8 clk_table_pbr[] = { 2, 3, 5, 7 };

/**
 * Function to setup CTAR's from configuration
 * @param spiHw - Pointer to HW SPI device
 * @param extDev - Pointer to external device configuration
 * @param ctar_unit - The ctar unit number to setup
 * @param width - The width in bits of the data to send with the CTAR
 */
static void Spi_SetupCTAR(	Spi_HWUnitType unit,
							const Spi_ExternalDeviceType *extDev,
							Spi_ChannelType ctar_unit,
							Spi_TransferStartType transferStart,
							uint8 width)
{
	uint32 clock;
	uint32 pre_br;
	int i;
	int j;
	uint32 tmp;
	McuE_PeriperalClock_t perClock;

	volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);
	/* BAUDRATE CALCULATION
	 * -----------------------------
	 * Baudrate = Fsys/ PBR * ( 1+ DBR) / BR
	 * PBR range: 2 to 7
	 * DBR range: 0 to 1
	 * BR : 2 to 32768
	 *
	 * To make this easy set DBR = 0 and PBR=2
	 * --> BR=Fsys/(Baudrate.* 2 )
	 *
	 */
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC560X)
	switch(unit) {
	case 0:
		perClock = PERIPHERAL_CLOCK_DSPI_A;
		break;
	case 1:
		perClock = PERIPHERAL_CLOCK_DSPI_B;
		break;
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5604B)
	case 2:
		perClock = PERIPHERAL_CLOCK_DSPI_C;
		break;
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
	case 3:
		perClock = PERIPHERAL_CLOCK_DSPI_D;
		break;
#endif
	default:
		assert(0);
		break;
	}
#else
#error CPU not supported
#endif
	clock = McuE_GetPeripheralClock(perClock);

	DEBUG(DEBUG_MEDIUM,"%s: Peripheral clock at %d Mhz\n",MODULE_NAME,clock);

	DEBUG(DEBUG_MEDIUM,"%s: Want to run at %d Mhz\n",MODULE_NAME,extDev->SpiBaudrate);

	spiHw->CTAR[ctar_unit].B.DBR = 0;
	spiHw->CTAR[ctar_unit].B.PBR = 0; // 2
	pre_br = clock / (extDev->SpiBaudrate
			* clk_table_pbr[spiHw->CTAR[ctar_unit].B.PBR]);

	// find closest lesser
	for (i = 0; i < sizeof(clk_table_br) / sizeof(clk_table_br[0]); i++) {
		if (clk_table_br[i] >= pre_br) {
			break;
		}
	}

	assert(i>=0);
	// Set it
	spiHw->CTAR[ctar_unit].B.BR = i;

	DEBUG(DEBUG_LOW,"%s: CLK %d Mhz\n",MODULE_NAME,
			clock / clk_table_pbr[spiHw->CTAR[ctar_unit].B.PBR] *
			( 1 + spiHw->CTAR[ctar_unit].B.DBR)/clk_table_br[spiHw->CTAR[ctar_unit].B.BR]);

	/* For other timings autosar only specifies SpiTimeClk2Cs == "After SCK delay"
	 * in Freescale language. The dumb thing is that this should be a relative time
	 * to the clock. Not fixed.
	 * Autosar specifies 0.0--100.0 ms(float)
	 * Our intepretation is 0--1000000 ns (uint32)
	 *
	 * AFTER SCK DELAY:
	 * -----------------------------
	 * Tasc = 1/Fsys * PASC  * ASC [s]
	 *
	 * Assume the Tasc get's here in ns( typical range is ~10ns )
	 */

	// Calc the PASC * ASC value...
	tmp = extDev->SpiTimeClk2Cs * (clock / 1000000);

	// Nothing fancy here...
	{
		int best_i = 0;
		int best_j = 0;
		int b_value = INT_MAX;
		int tt;

		// Find the best match of Prescaler and Scaler value
		for (i = 0; i < ARRAY_SIZE(clk_table_pasc); i++) {
			for (j = 0; j < ARRAY_SIZE(clk_table_asc); j++) {
				tt = abs((int) clk_table_pasc[i] * clk_table_asc[j] * 1000
						- tmp);
				if (tt < b_value) {
					best_i = i;
					best_j = j;
					b_value = tt;
				}
			}
		}

		/* After SCK delay. */
		spiHw->CTAR[ctar_unit].B.PASC = best_i;
		spiHw->CTAR[ctar_unit].B.ASC = best_j;
	}

	DEBUG(DEBUG_MEDIUM,"%s: Timing: Tasc %d ns\n",MODULE_NAME,
			clk_table_pasc[spiHw->CTAR[ctar_unit].B.PASC] *
			clk_table_asc[spiHw->CTAR[ctar_unit].B.ASC] * 1000/ (clock/1000000) );

	/* The PCS to SCK delay is the delay between the assertion of PCS and
	 * the first edge the SCK.
	 *
	 * PCS TO SCK DELAY:
	 * -----------------------------
	 * Tcsc = 1/Fsys * PCSSCK * CSSCK [s]
	 */

	// Calc the PCSSCK * CSSCK value...
	tmp = extDev->SpiTimeCs2Clk * (clock / 1000000);

	// Nothing fancy here...
	{
		int best_i = 0;
		int best_j = 0;
		int b_value = INT_MAX;
		int tt;

		// Find the best match of Prescaler and Scaler value
		for (i = 0; i < ARRAY_SIZE(clk_table_pcssck); i++) {
			for (j = 0; j < ARRAY_SIZE(clk_table_cssck); j++) {
				tt = abs((int) clk_table_pcssck[i] * clk_table_cssck[j] * 1000
						- tmp);
				if (tt < b_value) {
					best_i = i;
					best_j = j;
					b_value = tt;
				}
			}
		}

		/* PCS to SCK delay */
		spiHw->CTAR[ctar_unit].B.PCSSCK = best_i;
		spiHw->CTAR[ctar_unit].B.CSSCK = best_j;
	}

	DEBUG(DEBUG_MEDIUM,"%s: Timing: Tcsc %d ns\n",MODULE_NAME,
			clk_table_pcssck[spiHw->CTAR[ctar_unit].B.PCSSCK] *
			clk_table_cssck[spiHw->CTAR[ctar_unit].B.CSSCK]*1000/(clock/1000000));

	/* Time that PCS is high between transfers */
	spiHw->CTAR[ctar_unit].B.PDT = 2;
	spiHw->CTAR[ctar_unit].B.DT = 2;

	DEBUG(DEBUG_MEDIUM,"%s: Timing: Tdt  %d ns\n",MODULE_NAME,
			clk_table_pasc[spiHw->CTAR[ctar_unit].B.PDT] *
			clk_table_asc[spiHw->CTAR[ctar_unit].B.DT]*1000/(clock/1000000));

	/* Data is transferred MSB first */

	spiHw->CTAR[ctar_unit].B.LSBFE = (transferStart == SPI_TRANSFER_START_MSB ) ? 0 : 1;

	/* Set mode */
	spiHw->CTAR[ctar_unit].B.FMSZ = width - 1;
	spiHw->CTAR[ctar_unit].B.CPHA = (extDev->SpiDataShiftEdge
			== SPI_EDGE_LEADING) ? 0 : 1;
	spiHw->CTAR[ctar_unit].B.CPOL = (extDev->SpiCsPolarity == STD_LOW) ? 0 : 1;

