openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	// This the ACTIVE polarity. Freescale have inactive polarity
	if (extDev->SpiCsPolarity == STD_HIGH) {
		spiHw->MCR.R &= ~(1 << (16 + extDev->SpiCsIdentifier));
	} else {
		spiHw->MCR.R |= (1 << (16 + extDev->SpiCsIdentifier));
	}
}

//-------------------------------------------------------------------

static void Spi_InitController(uint32 unit) {
	volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);
	Spi_UnitType *spiUnit = GET_SPI_UNIT_PTR(unit);

	/* Module configuration register. */
	/* Master mode. */
	spiHw->MCR.B.MSTR = 1;
	/* No freeze. Run SPI when debugger is stopped. */
	spiHw->MCR.B.FRZ = 0;
	/* PSC5 as regular CS. */
	spiHw->MCR.B.PCSSE = 0;

	/* Enable FIFO's. */
#if (SPI_IMPLEMENTATION == SPI_DMA)
	spiHw->MCR.B.DIS_RXF = 1;
	spiHw->MCR.B.DIS_TXF = 1;
#elif (SPI_IMPLEMENTATION == SPI_FIFO)
    spiHw->MCR.B.DIS_RXF = 0;
    spiHw->MCR.B.DIS_TXF = 0;
#endif


	/* Set all active low. */
	spiHw->MCR.B.PCSIS0 = 1;
	spiHw->MCR.B.PCSIS1 = 1;
	spiHw->MCR.B.PCSIS2 = 1;
	spiHw->MCR.B.PCSIS3 = 1;
	spiHw->MCR.B.PCSIS4 = 1;
	spiHw->MCR.B.PCSIS5 = 1;

#if (SPI_IMPLEMENTATION == SPI_DMA)
	/* DMA TX FIFO fill. */
	spiHw->RSER.B.TFFF_RE = 1;
	spiHw->RSER.B.TFFF_DIRS = 1;

	/* DMA RX FIFO drain. */
	spiHw->RSER.B.RFDF_RE = 1;
	spiHw->RSER.B.RFDF_DIRS = 1;
#endif

	// Setup CTAR's channel codes..
	for (int i = 0; i < 7; i++) {
		spiUnit->channelCodes[i] = CH_NOT_VALID;
	}

	/* Force to stopped state. */
	spiHw->MCR.B.HALT = 1;

	spiHw->SR.B.EOQF = 1;

	/* Enable clocks. */
	spiHw->MCR.B.MDIS = 0;

#if defined(__DMA_INT)
	Irq_InstallVector(Spi_Isr_DMA, 16 , 1, CPU_Z1);
#endif

	// Install EOFQ int..
	switch (unit) {
#if defined(CFG_MPC560X)
	case 0:
	ISR_INSTALL_ISR2("SPI_A",Spi_Isr_A, DSPI_0_ISR_EOQF, 15, 0);
	break;
	case 1:
	ISR_INSTALL_ISR2("SPI_B",Spi_Isr_B, DSPI_1_ISR_EOQF, 15, 0);
	break;
#if defined(CFG_MPC5604B)
	case 2:
	ISR_INSTALL_ISR2("SPI_C",Spi_Isr_C, DSPI_2_ISR_EOQF, 15, 0);
	break;
#endif
#elif defined(CFG_MPC5516) || defined(CFG_MPC5517)
	case 0:
	ISR_INSTALL_ISR2("SPI_A",Spi_Isr_A, DSPI_A_ISR_EOQF, 15, 0);
	break;
	case 1:
	ISR_INSTALL_ISR2("SPI_B",Spi_Isr_B, DSPI_B_ISR_EOQF, 15, 0);
	break;
	case 2:
	ISR_INSTALL_ISR2("SPI_A",Spi_Isr_C, DSPI_C_ISR_EOQF, 15, 0);
	break;
	case 3:
	ISR_INSTALL_ISR2("SPI_B",Spi_Isr_D, DSPI_D_ISR_EOQF, 15, 0);
	break;
#else
#error ISR NOT installed.
#endif
	}
}

//-------------------------------------------------------------------

#if (SPI_IMPLEMENTATION==SPI_DMA)
static void Spi_DmaSetup(uint32 unit) {

	Dma_TcdType *tcd;

	tcd = &Spi_Unit[unit].dmaTxTCD;
	*tcd = Spi_DmaTx;
	tcd->SADDR = (uint32) Spi_Unit[unit].txQueue;
	tcd->DADDR = (uint32) &(GET_SPI_HW_PTR(unit)->PUSHR.R);

	Dma_StopChannel(Spi_Unit[unit].dmaTxChannel);
	Dma_CheckConfig();

	// CITER and BITER set when we send
	tcd = &Spi_Unit[unit].dmaRxTCD;
	*tcd = Spi_DmaRx;
	tcd->SADDR = (uint32) &(GET_SPI_HW_PTR(unit)->POPR.R);
	tcd->DADDR = (uint32) Spi_Unit[unit].rxQueue;

	Dma_StopChannel(Spi_Unit[unit].dmaRxChannel);
	Dma_CheckConfig();

}
#endif

//-------------------------------------------------------------------

void Spi_Init(const Spi_ConfigType *ConfigPtr) {

	const Spi_JobConfigType *jobConfig2;

	memset(&Spi_Global,0,sizeof(Spi_Global));
	Spi_Global.configPtr = ConfigPtr;
	Spi_Global.extBufPtr = Spi_Eb;

	Spi_Global.asyncMode = SPI_INTERRUPT_MODE;

	// Set all sequence results to OK
	for (Spi_SequenceType i = (Spi_SequenceType) 0; i < SPI_MAX_SEQUENCE; i++) {
		Spi_SetSequenceResult(i, SPI_SEQ_OK);
	}

	// Figure out what HW controllers that are used
	for (int j = 0; j < Spi_GetJobCnt(); j++) {
		jobConfig2 = &Spi_Global.configPtr->SpiJobConfig[j];
		Spi_Global.spiHwConfigured |= (1 << jobConfig2->SpiHwUnit);
	}

	// Initialize controllers used
	{
		uint32 confMask;
		uint8 confNr;

		confMask = Spi_Global.spiHwConfigured;

		for (; confMask; confMask &= ~(1 << confNr)) {
			confNr = ilog2(confMask);
			DEBUG(DEBUG_LOW,"%s:Configured HW controller %d\n",MODULE_NAME,confNr);
			Spi_InitController(confNr);
			Spi_SetHWUnitStatus(confNr, SPI_IDLE);

#if (SPI_IMPLEMENTATION == SPI_DMA )
			// DMA init...
			//

			/* Make sure that this channel shall be used. */
			//assert (ConfigPtr->SpiHwConfig[confNr].Activated);
			assert(Spi_DmaConfig[confNr].TxDmaChannel != (-1));
			assert(Spi_DmaConfig[confNr].RxDmaChannel != (-1));

			Spi_Unit[confNr].dmaTxChannel = Spi_DmaConfig[confNr].TxDmaChannel;
			Spi_Unit[confNr].dmaRxChannel = Spi_DmaConfig[confNr].RxDmaChannel;

			Spi_DmaSetup(confNr);
#endif

		}
	}

	/* Setup the relations for Job, for easy access */
	for(int j=0; j<SPI_MAX_JOB; j++ ) {
		jobConfig2 = &Spi_Global.configPtr->SpiJobConfig[j];
		Spi_JobUnit[j].jobCfgPtr = jobConfig2;
		Spi_JobUnit[j].extDeviceCfgPtr = &Spi_Global.configPtr->SpiExternalDevice[jobConfig2->DeviceAssignment];
		Spi_JobUnit[j].unitPtr = GET_SPI_UNIT_PTR(jobConfig2->SpiHwUnit);
		Spi_JobUnit[j].hwPtr= GET_SPI_HW_PTR(jobConfig2->SpiHwUnit);
		Spi_JobUnit[j].channelsPtr = &jobConfig2->ChannelAssignment[0];
	}

	/* Setup CTARS, configuration */
	{
		Spi_UnitType *spiUnit;

		int j = 0;
		int k;
		int l;
		uint32 channelCode;
		int channelIndex;

		const Spi_JobConfigType *jobConfig;
		const Spi_ChannelConfigType *chConfig;

		for (j = 0; j < Spi_GetJobCnt(); j++) {
			jobConfig = &Spi_Global.configPtr->SpiJobConfig[j];
			spiUnit = GET_SPI_UNIT_PTR( jobConfig->SpiHwUnit );

			// Also find the controllers used while we are at it
			Spi_Global.spiHwConfigured |= (1 << jobConfig->SpiHwUnit);

			// ..and set the job status
			Spi_SetJobResult((Spi_JobType) j, SPI_JOB_OK);

			l = 0;
			// Go through all the jobs and it's channels to setup CTAS
			// A job have the same physical controller ( SpiHwUnit )
			while ((channelIndex = jobConfig->ChannelAssignment[l++])
					!= CH_NOT_VALID) {
				chConfig = &Spi_Global.configPtr->SpiChannelConfig[channelIndex];

				// Form a channel code from
				// <MSB/LSB><external_device_id><channel width>
				channelCode = ( ((uint32_t)chConfig->SpiTransferStart << 16) +
								(jobConfig->DeviceAssignment << 8) +
								chConfig->SpiDataWidth);

				for (k = 0; k < 7; k++) {
					if (spiUnit->channelCodes[k] == channelCode) {
						Spi_ChannelInfo[channelIndex].ctarId = k;
						DEBUG(DEBUG_LOW,"%s: Channel %d re-uses CTAR %d@%d . device=%d,width=%d\n",MODULE_NAME,channelIndex,k,jobConfig->SpiHwUnit,jobConfig->DeviceAssignment,chConfig->SpiDataWidth);
						// already in list, break
						break;
					}

					if (spiUnit->channelCodes[k] == CH_NOT_VALID) {
						// Add to list
						spiUnit->channelCodes[k] = channelCode;
						// Assign the CTAR index to channel info..
						DEBUG(DEBUG_LOW,"%s: Channel %d uses    CTAR %d@%d . device=%d,width=%d\n",MODULE_NAME,channelIndex,k,jobConfig->SpiHwUnit,jobConfig->DeviceAssignment,chConfig->SpiDataWidth);

						Spi_SetupCTAR(
								jobConfig->SpiHwUnit,
								Spi_GetExternalDevicePtrFromIndex( jobConfig->DeviceAssignment),
								(Spi_ChannelType) k,
								chConfig->SpiTransferStart,
								chConfig->SpiDataWidth);

						Spi_ChannelInfo[channelIndex].ctarId = k;
						break;
					}
				}
				/* No more CTARS */
				assert(k<7);
			}
		}
	}

	Spi_Global.initRun = TRUE;
}

//-------------------------------------------------------------------

Std_ReturnType Spi_DeInit(void) {
	volatile struct DSPI_tag *spiHw;
	uint32 confMask;
	uint8 confNr;

	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_DEINIT_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
	if (Spi_GetStatus() == SPI_BUSY)
		return E_NOT_OK;

	// Disable the HW modules ( SPI021 )
	confMask = Spi_Global.spiHwConfigured;

