openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	// Disable the SPI hw
	for (; confMask; confMask &= ~(1 << confNr)) {
		confNr = ilog2(confMask);
		spiHw = GET_SPI_HW_PTR(confNr);
		// Disable the hardware..
		spiHw->MCR.B.MDIS = 1;

		Spi_InitController(confNr);
		Spi_SetHWUnitStatus(confNr, SPI_IDLE);
	}

	// SPI022
	Spi_Global.configPtr = NULL;
	Spi_Global.initRun = FALSE;

	return E_OK;
}

#if (SPI_IMPLEMENTATION==SPI_DMA)
/**
 *
 * @param spiUnit
 * @param jobConfig
 * @return
 */
static void Spi_DoWrite_DMA(	Spi_UnitType *spiUnit,Spi_JobType jobIndex,
						const Spi_JobConfigType *jobConfig )
{
	int j = 0;
	int k = 0;
	int channelIndex;
	const Spi_ChannelConfigType *chConfig;
	Spi_EbType *extChBuff;
	Spi_CommandType cmd;

	cmd.R = 0;

	// Find the channels for this job
	while ((channelIndex = jobConfig->ChannelAssignment[j++]) != CH_NOT_VALID) {
		chConfig = &Spi_Global.configPtr->SpiChannelConfig[channelIndex];

		/* Check configuration error */
#if ( SPI_CHANNEL_BUFFERS_ALLOWED == 1  )
		assert( chConfig->SpiChannelType == SPI_EB );
#endif

		// Send the channels that are setup with external buffers
		// Get the external buffer for this channel
		extChBuff = &Spi_Global.extBufPtr[channelIndex];

		if (extChBuff->active == 0) {
			LDEBUG_PRINTF("Err:External buffer %d@job %d not setup\n",channelIndex,jobIndex);
			(void)jobIndex;
			assert(0);
		}

		// Start to fill the SPI queue for the DMA:
		for (k = 0; k < extChBuff->length; k++) {
			uint32 csId =
			Spi_Global.configPtr->SpiExternalDevice[jobConfig->DeviceAssignment].SpiCsIdentifier;
			// Build cmd
			cmd.B.CONT = 1; // Channels should keep CS active
			// ( A job must assert CS continuously)
			cmd.R |= (1 << (16 + csId)); // Set PCS
			cmd.B.EOQ = 0;
			cmd.B.CTAS = Spi_ChannelInfo[channelIndex].ctarId;
			if (extChBuff->src != NULL) {
				if (chConfig->SpiDataWidth > 8) {
					cmd.B.TXDATA = (extChBuff->src[k] << 8) + (extChBuff->src[k
							+ 1] & 0xff);
					k++;
				} else {
					cmd.B.TXDATA = extChBuff->src[k];
				}
			} else {
				cmd.B.TXDATA = chConfig->SpiDefaultData;
			}

			// Just keep on filling the tx queue
			spiUnit->txQueue[spiUnit->txCurrIndex++].R = cmd.R;
		}
	} /*while( channelIndex == */

	// send last part
	cmd.B.CONT = 0; // CS high
	cmd.B.EOQ = 1; // last in queue
	spiUnit->txQueue[--spiUnit->txCurrIndex].R = cmd.R;

	// Set the length of the data to send
	spiUnit->dmaTxTCD.CITER = spiUnit->txCurrIndex + 1;
	spiUnit->dmaTxTCD.BITER = spiUnit->txCurrIndex + 1;

	Spi_Global.totalNbrOfStartedJobs++;

	RAMLOG_STR("Job: "); RAMLOG_DEC(jobIndex); RAMLOG_STR(" Cnt: "); RAMLOG_DEC(spiUnit->txCurrIndex+1); RAMLOG_STR("\n");

	DEBUG(DEBUG_LOW,"%s:Tx Job:%d cnt:%d first data:%04x\n",MODULE_NAME,jobIndex,spiUnit->txCurrIndex+1,spiUnit->txQueue[0].B.TXDATA);

	{
		Spi_UnitType *spiUnit = GET_SPI_UNIT_PTR(jobConfig->SpiHwUnit);
		volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(jobConfig->SpiHwUnit);

		Dma_ConfigureChannel((Dma_TcdType *) &spiUnit->dmaTxTCD,
				spiUnit->dmaTxChannel);
		Dma_ConfigureChannel((Dma_TcdType *) &spiUnit->dmaRxTCD,
				spiUnit->dmaRxChannel);
		/* Flush TX/Rx FIFO.  Ref. man. 23.5.1 step 8 */
		spiHw->MCR.B.CLR_RXF = 1;
		spiHw->MCR.B.CLR_TXF = 1;

		Dma_StartChannel(spiUnit->dmaRxChannel);
		Dma_StartChannel(spiUnit->dmaTxChannel);

		// Step 9. Clear TCNT
		spiHw->TCR.B.SPI_TCNT = 0;

		if (	(Spi_Global.asyncMode == SPI_INTERRUPT_MODE) &&
				(spiUnit->callType == SPI_ASYNC_CALL)) {
			ENABLE_EOQ_INTERRUPT(spiHw);
		} else {
			DISABLE_EOQ_INTERRUPT(spiHw);
		}

		/* This will trig a new transfer. Ref. man. 23.5.1 step 11 */
		spiHw->SR.B.EOQF = 1;
		spiHw->MCR.B.HALT = 0;

		// Since it's not obvious on how to tell when a SPI sequence
		// is sent, keep things below to what things have been tested.
#if defined(STEP_VALIDATION)
		/* Wait for transfer to complete (EOQF bit is set) */
		while (spiHw->SR.B.EOQF==1) {
			Spi_Global.eoqf_cnt++;
		}
		while (spiHw->SR.B.TXRXS) {Spi_Global.txrxs_cnt++;}
		while( EDMA.TCD[spiUnit->dmaRxChannel].ACTIVE ) {;}
#endif

	}
}
#endif

#if (SPI_IMPLEMENTATION==SPI_FIFO)
/**
 *
 * @param spiUnit
 * @param jobConfig
 * @return
 */
static void Spi_WriteJob_FIFO( Spi_JobType jobIndex )
{
	Spi_ChannelType                 currChannel;
	Spi_CommandType                 cmd;
	Spi_CommandType                 dCmd;
    Spi_NumberOfDataType            bufLen;
	const Spi_ChannelConfigType *   chConfig;
    Spi_JobUnitType *               jobUnitPtr;
    const Spi_DataType *            buf;
    Spi_NumberOfDataType            copyCnt;
    Spi_NumberOfDataType            fifoLeft;
    boolean                         done = 0;
    boolean                         lastJob = 0;
	int     i;
	jobUnitPtr = &Spi_JobUnit[jobIndex];


	fifoLeft = FIFO_DEPTH;

	RAMLOG_STR("Spi_WriteJob_FIFO\n");

#if defined(STEP_VALIDATION)
    if(  jobUnitPtr->hwPtr->SR.B.TXCTR != 0 ) {
        while(1) {};
    }
#endif

    cmd.R = 0;
    dCmd.R = 0xfffffffful;

	/* Iterate over the channels for this job */
    currChannel = jobUnitPtr->channelsPtr[jobUnitPtr->currTxChIndex];
    while ( fifoLeft != 0) {

		chConfig = &Spi_Global.configPtr->SpiChannelConfig[currChannel];
		buf = spiGetTxBuf( currChannel, &bufLen);

		/* Minimum of how much data to copy and the limit of the FIFO */
		copyCnt = MIN( (bufLen - jobUnitPtr->txChCnt) >> ((chConfig->SpiDataWidth-1)/8), fifoLeft );

        /* Channels should keep CS active ( A job must assert CS continuously) */
        cmd.B.CONT = 1;
        /* Set the Chip Select (PCS) */
        cmd.R |= (1 << (16 + jobUnitPtr->extDeviceCfgPtr->SpiCsIdentifier));

        if( cmd.B.EOQ == 1) {
            while(1) {};
        }

        /* Push as much as we can (FIFO or Channel limits) */
        for(i=0; i < copyCnt ; i++ ) {
            cmd.B.CTAS = Spi_ChannelInfo[currChannel].ctarId;
            if (buf != NULL) {
                if (chConfig->SpiDataWidth > 8 ) {
                    cmd.B.TXDATA =  (buf[jobUnitPtr->txChCnt] << 8) +
                                    (buf[jobUnitPtr->txChCnt  + 1] & 0xff);
                } else {
                    cmd.B.TXDATA = buf[jobUnitPtr->txChCnt];
                }
            } else {
                cmd.B.TXDATA = chConfig->SpiDefaultData;
            }

            if (chConfig->SpiDataWidth > 8 ) {
                jobUnitPtr->txChCnt+=2;
            } else {
                jobUnitPtr->txChCnt++;
            }


            if( dCmd.R != 0xfffffffful) {
                jobUnitPtr->hwPtr->PUSHR.R = dCmd.R;  // Write delayed
            }

            dCmd.R = cmd.R;     // Save it
            --fifoLeft;
        } /* for */

