openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
        RAMLOG_STR("CI#");RAMLOG_DEC(jobUnitPtr->currTxChIndex);RAMLOG_STR("\n");


        /* Done with channel? */
        if( ((bufLen -  jobUnitPtr->txChCnt) == 0) ) {
            jobUnitPtr->txChCnt = 0;
            /* Done with job? */
            jobUnitPtr->currTxChIndex++;
            currChannel = jobUnitPtr->channelsPtr[jobUnitPtr->currTxChIndex];
            if( currChannel == CH_NOT_VALID ) {
                jobUnitPtr->currTxChIndex = 0;
                cmd.B.CONT = 0;
                break;
            }
        }

    } /* while */

    cmd.B.EOQ = 1;
    jobUnitPtr->hwPtr->PUSHR.R = cmd.R;

    jobUnitPtr->fifoSent = FIFO_DEPTH - fifoLeft;

#if defined(STEP_VALIDATION)
	if( jobUnitPtr->fifoSent != jobUnitPtr->hwPtr->SR.B.TXCTR ) {
	    while(1);
	}
#endif

	jobUnitPtr->hwPtr->TCR.B.SPI_TCNT = 0;

    if ( (Spi_Global.asyncMode == SPI_INTERRUPT_MODE) &&
         (jobUnitPtr->unitPtr->callType == SPI_ASYNC_CALL)) {
        ENABLE_EOQ_INTERRUPT(jobUnitPtr->hwPtr);
    } else {
        DISABLE_EOQ_INTERRUPT(jobUnitPtr->hwPtr);
    }

#if defined(STEP_VALIDATION)
    /* Verify FIFO before sending */
    {
        SPICommandType *base = (SPICommandType *)&jobUnitPtr->hwPtr->TXFR[0];
        SPICommandType *curr;
        int i,lastIndex;

        i = jobUnitPtr->hwPtr->SR.B.TXNXTPTR;
        lastIndex = ( i + jobUnitPtr->hwPtr->SR.B.TXCTR - 1 ) % FIFO_DEPTH;
        while( i != lastIndex )  {
            curr = base + i;
            if( curr->B.EOQ == 1) {
                while(1) {};
            }

            i = (i + 1) % FIFO_DEPTH;
        }
        curr = base + i;
        if( curr->B.EOQ != 1) {
            while(1) {};
        }
    }
#endif

	jobUnitPtr->hwPtr->SR.B.EOQF = 1;
	jobUnitPtr->hwPtr->MCR.B.HALT = 0;

#if defined(STEP_VALIDATION)
        /* Wait for transfer to complete (EOQF bit is set) */
        while (jobUnitPtr->hwPtr->SR.B.EOQF==1) {
            Spi_Global.eoqf_cnt++;
        }
        while (jobUnitPtr->hwPtr->SR.B.TXRXS) {Spi_Global.txrxs_cnt++;}
#endif

	// TODO: Clear FIFO's? CLR_TXF?

}
#endif /* (SPI_IMPLEMENTATION==SPI_FIFO) */


//-------------------------------------------------------------------




/**
 * Write a job to the SPI bus
 *
 * @param jobIndex The job to write to the SPI bus
 */
static void Spi_JobWrite(Spi_JobType jobIndex) {
	Spi_UnitType *unitPtr = Spi_JobUnit[jobIndex].unitPtr;

	unitPtr->txCurrIndex = 0;
	unitPtr->currJob = Spi_JobUnit[jobIndex].jobCfgPtr;
	unitPtr->currJobIndex = jobIndex;
#if (SPI_IMPLEMENTATION == SPI_FIFO)
	Spi_JobUnit[jobIndex].txChCnt = 0;
	Spi_JobUnit[jobIndex].rxChCnt = 0;
#endif

	Spi_SetHWUnitStatus(Spi_JobUnit[jobIndex].jobCfgPtr->SpiHwUnit, SPI_BUSY);
	Spi_SetJobResult(jobIndex, SPI_JOB_PENDING);

#if (USE_DIO_CS == STD_ON)
    if( Spi_JobUnit[jobIndex].extDeviceCfgPtr->SpiCsCallback != NULL ) {
        Spi_JobUnit[jobIndex].extDeviceCfgPtr->SpiCsCallback(1);
    }
#endif

#if (SPI_IMPLEMENTATION==SPI_DMA)
	Spi_DoWrite_DMA( unitPtr, jobIndex, Spi_JobUnit[jobIndex].jobCfgPtr );
#elif (SPI_IMPLEMENTATION==SPI_FIFO)
	Spi_JobUnit[jobIndex].currTxChIndex = 0;
	Spi_WriteJob_FIFO ( jobIndex );
#endif

}


void Spi_PrintSeqInfo(const Spi_SequenceConfigType *seqConfigPtr) {
	int i = 0;
	uint32 job;
	DEBUG(DEBUG_HIGH,"%s: Seq: %d:",MODULE_NAME,seqConfigPtr->SpiSequenceId);

	while ((job = seqConfigPtr->JobAssignment[i]) != JOB_NOT_VALID) {
		DEBUG(DEBUG_HIGH,"%d ",job);
		i++;
	} DEBUG(DEBUG_HIGH,"\n");
}


/**
 * Write a sequence to the SPI bus
 *
 * @param seqIndex The sequence
 * @param sync 1 - make the call sync. 0 - make the call async
 */
static void Spi_SeqWrite(Spi_SequenceType seqIndex, Spi_CallTypeType sync) {

	const Spi_SequenceConfigType *seqConfig;
	const Spi_JobConfigType *jobConfig;
	Spi_UnitType *spiUnit;
	Spi_JobType jobIndex;

	seqConfig = Spi_GetSeqPtrFromIndex(seqIndex);
	jobIndex = seqConfig->JobAssignment[0];
	jobConfig = Spi_GetJobPtrFromIndex(jobIndex);

	spiUnit = Spi_GetUnitPtrFromIndex(jobConfig->SpiHwUnit);

	/* Fill in the required fields for job and sequence.. */
	spiUnit->currJobIndexPtr = &seqConfig->JobAssignment[0];
	spiUnit->callType = sync;
	spiUnit->currSeqPtr = seqConfig;

	Spi_SetSequenceResult(seqIndex, SPI_SEQ_PENDING);

	// Setup interrupt for end of queue
	if (	(Spi_Global.asyncMode == SPI_INTERRUPT_MODE) &&
			(spiUnit->callType== SPI_ASYNC_CALL)) {
		DEBUG(DEBUG_MEDIUM,"%s: async/interrupt mode\n",MODULE_NAME);
	} else {
		DEBUG(DEBUG_MEDIUM,"%s: sync/polled mode\n",MODULE_NAME);
	}

#if defined(USE_LDEBUG_PRINTF) && ( DEBUG_LVL <= DEBUG_HIGH )
	Spi_PrintSeqInfo( seqConfig );
#endif

	Spi_JobWrite(jobIndex);

	if (spiUnit->callType == SPI_SYNC_CALL) {
		while (Spi_GetSequenceResult(seqIndex) == SPI_SEQ_PENDING) {
			Spi_Isr(jobConfig->SpiHwUnit);
		}
	}

}

//-------------------------------------------------------------------
static _Bool Spi_AnyPendingJobs(Spi_SequenceType Sequence) {

	// Check that we don't share any jobs with another sequence that is SPI_SEQ_PENDING
	for (int i = 0; i < SPI_MAX_SEQUENCE; i++) {
		if (i == Sequence) {
			continue;
		}

		if (Spi_GetSequenceResult(i) == SPI_SEQ_PENDING) {
			// We have found a pending sequence... check that we don't share any jobs
			// with that sequence, SPI086
			if (Spi_ShareJobs(Sequence, i)) {
				return 1;
			}
		}
	}

	return 0;
}

//-------------------------------------------------------------------


/**
 * Blocking write
 *
 * @param Sequence
 * @return
 */
Std_ReturnType Spi_SyncTransmit(Spi_SequenceType Sequence) {

	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_SYNCTRANSMIT_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
	VALIDATE_W_RV( ( SPI_MAX_SEQUENCE>Sequence ), SPI_SYNCTRANSMIT_SERVICE_ID, SPI_E_PARAM_SEQ, E_NOT_OK );
	Std_ReturnType rv = E_OK;

	if (Spi_GetSequenceResult(Sequence) == SPI_SEQ_PENDING) {
		DEBUG(DEBUG_LOW,"%s: Spi_AsyncTransmit() is PENDING\n",MODULE_NAME);
		return E_NOT_OK; // SPI157
	}

