openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	assert(Spi_GetSequenceResult(Sequence) == SPI_SEQ_OK);

	if (Spi_AnyPendingJobs(Sequence)) {
		return E_NOT_OK;
	}

	Spi_SeqWrite(Sequence, SPI_SYNC_CALL);

	return rv;
}

//-------------------------------------------------------------------

Std_ReturnType Spi_AsyncTransmit(Spi_SequenceType Sequence) {
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_ASYNCTRANSMIT_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
	VALIDATE_W_RV( ( SPI_MAX_SEQUENCE>Sequence ), SPI_ASYNCTRANSMIT_SERVICE_ID, SPI_E_PARAM_SEQ, E_NOT_OK );

	if (Spi_GetSequenceResult(Sequence) == SPI_SEQ_PENDING) {
		DEBUG(DEBUG_LOW,"%s: Spi_AsyncTransmit() is PENDING\n",MODULE_NAME);
		return E_NOT_OK; // SPI157
	}

	assert(Spi_GetSequenceResult(Sequence) == SPI_SEQ_OK);

	if (Spi_AnyPendingJobs(Sequence)) {
		return E_NOT_OK;
	}

	DEBUG(DEBUG_LOW,"%s: Starting seq: %d\n",MODULE_NAME,Sequence);

	Spi_SeqWrite(Sequence, SPI_ASYNC_CALL);

	return E_OK;
}

//-------------------------------------------------------------------


Std_ReturnType Spi_ReadIB(	Spi_ChannelType Channel,
							Spi_DataType * const DataBufferPtr)
{
	(void)DataBufferPtr;

	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_READIB_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
	VALIDATE_W_RV( ( Channel<SPI_MAX_CHANNEL ), SPI_READIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
	VALIDATE_W_RV( ( SPI_IB<Spi_Global.configPtr->SpiChannelConfig[Channel].SpiChannelType ),
			SPI_READIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );

	/* NOT SUPPORTED */

	Std_ReturnType rv = E_NOT_OK;
	return rv;
}

//-------------------------------------------------------------------

Std_ReturnType Spi_SetupEB(	Spi_ChannelType Channel,
							const Spi_DataType* SrcDataBufferPtr,
							Spi_DataType* DesDataBufferPtr,
							Spi_NumberOfDataType Length)
{
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_SETUPEB_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
	VALIDATE_W_RV( ( Channel<SPI_MAX_CHANNEL ), SPI_SETUPEB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
#if ( SPI_CHANNEL_BUFFERS_ALLOWED == 1 )
	VALIDATE_W_RV( ( SPI_EB==Spi_Global.configPtr->SpiChannelConfig[Channel].SpiChannelType ),
			SPI_SETUPEB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
#endif
	// SPI067
	VALIDATE_W_RV( ( Length<=Spi_Global.configPtr->SpiChannelConfig[Channel].SpiEbMaxLength ),
			SPI_SETUPEB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );

	Spi_EbType *extChBuff = &Spi_Global.extBufPtr[Channel];
	const Spi_ChannelConfigType *chConfig =
			&Spi_Global.configPtr->SpiChannelConfig[Channel];

	if (chConfig->SpiChannelType == SPI_EB) {
		extChBuff->src = SrcDataBufferPtr;
		extChBuff->dest = DesDataBufferPtr;
		extChBuff->length = Length;
		extChBuff->active = 1;
	} else {
		/* NOT SUPPORTED */
		assert(0);
		while (1)
			;
	}

	return E_OK;
}

//-------------------------------------------------------------------

Spi_StatusType Spi_GetStatus(void) {
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETSTATUS_SERVICE_ID, SPI_E_UNINIT, SPI_UNINIT );

	// Check all sequences if they have any job pending
	for (int i = 0; i < SPI_MAX_SEQUENCE; i++) {
		if (Spi_GetSequenceResult(i) == SPI_SEQ_PENDING) {
			return SPI_BUSY;
		}
	}

	return SPI_IDLE;
}

//-------------------------------------------------------------------


Spi_JobResultType Spi_GetJobResult(Spi_JobType Job) {
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETJOBRESULT_SERVICE_ID, SPI_E_UNINIT, SPI_JOB_FAILED );
	VALIDATE_W_RV( ( SPI_MAX_JOB<Job ), SPI_GETJOBRESULT_SERVICE_ID, SPI_E_PARAM_JOB, SPI_JOB_FAILED );

	return Spi_JobUnit[Job].jobResult;
}

//-------------------------------------------------------------------


Spi_SeqResultType Spi_GetSequenceResult(Spi_SequenceType Sequence) {
	Spi_SeqResultType rv;

	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETSEQUENCERESULT_SERVICE_ID, SPI_E_UNINIT, SPI_SEQ_FAILED );
	VALIDATE_W_RV( ( SPI_MAX_SEQUENCE>Sequence ), SPI_GETSEQUENCERESULT_SERVICE_ID, SPI_E_PARAM_SEQ, SPI_SEQ_FAILED );

	rv = Spi_SeqUnit[Sequence].seqResult;

	return rv;
}

//-------------------------------------------------------------------

Spi_StatusType Spi_GetHWUnitStatus(Spi_HWUnitType HWUnit) {
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETHWUNITSTATUS_SERVICE_ID, SPI_E_UNINIT, SPI_UNINIT );

	return Spi_Unit[HWUnit].status;
}

//-------------------------------------------------------------------

#if (SPI_CANCEL_API == STD_ON )
void Spi_Cancel( Spi_SequenceType Sequence ) {
	VALIDATE( ( TRUE == Spi_Global.initRun ), SPI_CANCEL_SERVICE_ID, SPI_E_UNINIT );
	VALIDATE( ( SPI_MAX_SEQUENCE<Sequence ), SPI_CANCEL_SERVICE_ID, SPI_E_PARAM_SEQ );

	/* NOT SUPPORTED */
}
#endif

//-------------------------------------------------------------------


#if ( SPI_LEVEL_DELIVERED == 2) // SPI154
Std_ReturnType Spi_SetAsyncMode(Spi_AsyncModeType Mode) {
	VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_SETASYNCMODE_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );

	// Note!
	// Not really sure by whom this function is supposed to be called by.
	// The users of SPI(e2,flash,etc) should probably not use this.

	for (int i = 0; i < SPI_MAX_SEQUENCE; i++) {
		if (Spi_GetSequenceResult(i) == SPI_SEQ_PENDING) {
			return E_NOT_OK;
		}
	}

	Spi_Global.asyncMode = Mode;

	return E_OK;
}
#endif

//-------------------------------------------------------------------

void Spi_MainFunction_Handling(void) {
	/* NOT SUPPORTED */
}

//-------------------------------------------------------------------

void Spi_MainFunction_Driving(void) {
	volatile struct DSPI_tag *spiHw;
	uint32 confMask;
	uint8 confNr;
	Spi_UnitType *spiUnit;

	// TODO: check that the queue is empty.. if so do the next job.
	if (Spi_Global.asyncMode == SPI_POLLING_MODE) {
		confMask = Spi_Global.spiHwConfigured;

		for (; confMask; confMask &= ~(1 << confNr)) {
			confNr = ilog2(confMask);
			spiHw = GET_SPI_HW_PTR(confNr);

			if (Spi_GetHWUnitStatus(confNr) == SPI_BUSY) {
				if (spiHw->SR.B.TXRXS) {
					// Still not done..
				} else {
					spiUnit = GET_SPI_UNIT_PTR(confNr);
					Spi_Isr(confNr);
				}
			}
		}
	}
}

